[
	{
		"autogen": false,
		"basescore": 20,
		"desc": "<p>Free points guyz.</p> <p>Since this is the first time we're holding this competition, we'd like some feedback on how we can improve. Come on, it's just ~5 minutes or so for 20 free points.</p> <p><a href=\"https://docs.google.com/forms/d/1VmReUSHT4vDdUJgyymzJzPJM5r59iyn4VpgBBDadvnU/viewform\" target=\"_blank\">EasyCTF Feedback Survey</a></p>\n",
		"displayname": "EasyCTF Survey",
		"grader": "survey",
		"hint": "Just click the link and complete the survey! No tricks here!",
		"threshold": 0,
		"weightmap": {}
	},


	{
		"autogen": false,
		"basescore": 30,
		"desc": "<p>Welcome to Python crash course! To get started, head over to the <a href=\"/exec\" target=\"_blank\">Python Editor</a> and print the string \"Hello, EasyCTF!\" exactly like that to the console.</p>\n",
		"displayname": "Python Basics 1",
		"grader": "python-basic-1",
		"hint": "Not sure how to print in Python? Look it up! It probably uses the <code>print</code> function.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 35,
		"desc": "<p>You're faced with a control panel. There are some instructions left on a sign nearby on the wall: This machine generates random numbers that you can access through the variable <code>args[0]</code>. If the number is greater than or equal to 0 and less than 100, print <code>hacks</code>. If the number is greater than or equal to 100, print <code>haxx</code>. If the number is negative, print <code>hakz</code>. Use the IDE to complete this problem.</p>\n",
		"displayname": "Python Basics 2",
		"grader": "python-basic-2",
		"hint": "What are <a href=\"http://en.wikibooks.org/wiki/Python_Programming/Conditional_Statements\" target=\"_blank\">conditionals</a>?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 40,
		"desc": "<p>How can you add strings in print statements? <code>args</code> is an array of 5 variables than can be accessed with <code> args[0]</code>, <code>args[1]</code> etc. Write some python code in the IDE to concatenate the variables together before printing.</p>\n",
		"displayname": "Python Basics 3",
		"grader": "python-basic-3",
		"hint": "Hmmm... how can you turn that pesky integer into a string?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 45,
		"desc": "<p><code>args</code> is an array of 5 variables than can be accessed with <code> args[0]</code>, <code>args[1]</code> etc. Write some python code in the IDE to concatenate <code>args[0]</code>, <code>args[1]</code>'s type (string or integer), <code>args[2]</code>'s length, <code>args[3]</code>'s square root as an integer (will be a perfect square), and <code>args[4]</code> in reverse.</p>\n",
		"displayname": "Python Basics 4",
		"grader": "python-basic-4",
		"hint": "I hope you're taking notes; this stuff will be on the harder problems :)",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 50,
		"desc": "<p>Given an list of unknown length of strings stored in <code>args</code>, for each string, take the first two characters and concatenate them into another string variable. Print the final variable.</p>\n",
		"displayname": "Python Basics 5",
		"grader": "python-basic-5",
		"hint": "Strings are very similar to lists...",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 55,
		"desc": "<p>Given an integer value stored in <code>args[0]</code>, find the sum of all numbers less than or equal to <code>args[0]</code> and greater than zero that are divisible by 7. Then, print the sum of all the digits of the original sum to get your answer.</p>\n",
		"displayname": "Python Basics 6",
		"grader": "python-basic-6",
		"hint": "What is a math operation to check divisibility?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 60,
		"desc": "<p>Given an list of integers stored in <code>args[0]</code> and an integer k stored in <code>args[1]</code>, sort them in descending order, then print the value at array index k from the sorted list.</p>\n",
		"displayname": "Python Basics 7",
		"grader": "python-basic-7",
		"hint": "I wonder if there's a built in sort function?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 65,
		"desc": "<p>A boolean is a value that is either True or False. Given an list of arrays of integers as <code>[a,b]</code> stored in <code>args</code>, for each array, if the sum of <code>a + b <= 25</code> then concatenate the value \"1\" to represent the value <code>True</code> to a string. Otherwise, concatenate \"0\" to represent the value <code>False</code>.</p>\n",
		"displayname": "Python Basics 8",
		"grader": "python-basic-8",
		"hint": "Use your knowledge from previous problems and apply it here!",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 70,
		"desc": "<p>Head over to the Python Editor and print the greatest common factor between <code>args[0]</code> and <code>args[1]</code>.</p>\n",
		"displayname": "Python Basics 9",
		"grader": "python-basic-9",
		"hint": "Defining a <i>function</i> that finds a GCF will be of use.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 75,
		"desc": "<p><code>args[0]</code> is a result of <code>XOR</code> encryption on two hexadecimal strings. You only know one of the two original strings, <code>args[1]</code>, can you find the other? \n\n</p>\n",
		"displayname": "Python Basics 10",
		"grader": "python-basic-10",
		"hint": "The operation <code>^</code> in python only works on numbers. The built in functions <code>ord()</code> and <code>chr()</code> convert between characters and numbers.",
		"threshold": 0,
		"weightmap": {}
	},

	{
		"autogen": false,
		"basescore": 30,
		"desc": "<p>Many servers (including web servers) are run on machines that use an operating system called Linux. Most of you are familiar with an operating system such as Windows or Mac OS X, or maybe a mobile operating system such as Android or iOS.</p> <p>Linux has a shell, or a command-line interface, which is similar to an interface you may see when you open Command Prompt on Windows or Terminal on Mac. In a shell, you type commands to the machine and it executes your command.</p> <p>Before you can learn how to hack, you have to learn how Linux works. Some basics for using linux:</p> <ul> <li><code>echo</code> - similar to <code>print</code> in most programming languages. Typing <code>echo &quot;hi&quot;</code> will literally print the word &quot;hi&quot; to the screen.</li> <li><code>cd</code> - stands for change directory. When you execute a command, you are always doing so from a specific directory. To change the directory, type <code>cd</code> and whichever directory you want to go to.</li> </ul> <p>In the first problem, we&#39;ll learn about a function called <code>ls</code>. Log in to the web shell, and type <code>cd /problems/ls</code> to get started.</p>\n",
		"displayname": "Linux Basics 1",
		"grader": "linux-basic-1",
		"hint": "If you're still unsure how to solve this problem, ask for help on the <a href=\"/irc\" target=\"_blank\">chat</a>.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 35,
		"desc": "<p>Now that you&#39;re somewhat familiar with&nbsp;how the Linux shell works, we&#39;ll move on to another command that is useful: <code><a href=\"http://linux.die.net/man/1/cat\" target=\"_blank\">cat</a></code>.</p> <p>To solve this problem, log into the shell server, and try to find out what&#39;s inside <code>/problems/cat/flag.txt</code>!</p>\n",
		"displayname": "Linux Basics 2",
		"grader": "linux-basic-2",
		"hint": "There are multiple ways to solve this problem; kudos to you if you find them all!",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 40,
		"desc": "<p>Ok, so now you know how to list files and read files... this is starting to sound more like a file manager you are familiar with, right? So what&#39;s left now? Searching.</p> <p>Luckily, there&#39;s also a command for that: <code>grep</code>. You know the drill, read up on the command, and then solve the problem in <code>/problems/grep</code>.</p> <p>The flag is the filename of the file containing the string <code>yep!</code>. All other files will contain the string <code>nope!</code>.</p>\n",
		"displayname": "Linux Basics 3",
		"grader": "linux-basic-3",
		"hint": "What character stands for \"all files\"?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 45,
		"desc": "<p>Alright time to get to some fun stuff: binaries. A&nbsp;<strong>binary</strong>&nbsp;is just a really fancy word that means a file (or in this case, a program) that contains some bits that are not text.</p> <p>The binary in this problem is a program. When you run it, it&#39;ll ask you for an input, but not just any input: a special character. To run this binary, navigate to the folder <code>/problems/pipe</code> and run <code>./pipe</code>.</p> <p>The source code is available for download <a href=\"/problem_data/linux-basic-4/pipe.c\" target=\"_blank\">here</a>, or you can find it at <code>/problems/pipe/pipe.c</code> on the shell server. The flag has been redacted.</p>\n",
		"displayname": "Linux Basics 4",
		"grader": "linux-basic-4",
		"hint": "A pipe can refer to a number of things, but the one you are probably most concerned about is this <code>|</code> symbol.",
		"threshold": 0,
		"weightmap": {}
	},


	{
		"autogen": false,
		"basescore": 70,
		"desc": "<p>I found this hashed password <code>dqcxxkgegmrunaue</code> and its hashing algorithm <a href=\"/problem_data/hash1/hash1.py\" target=\"_blank\">hash1.py</a>. Can you find the password?</p>\n",
		"displayname": "Hashing 1",
		"grader": "hash1",
		"hint": "Maybe there's more than 1 password that works...",
		"threshold": 0,
		"weightmap": {}
	},

	{
		"autogen": false,
		"basescore": 70,
		"desc": "<p>The function <code>printf</code> can do a lot of great things, but depends on how you use it. Try to exploit this <i>very</i> irresponsible use of <code>printf</code>.</p><p>Problem can be found at <code>/problems/format1</code> and source can be downloaded <a href=\"/problem_data/format1/format1.c\" target=\"_blank\">here</a>.</p>\n",
		"displayname": "Format 1",
		"grader": "format1",
		"hint": "This line might interest you... <code>printf(argv[1]);</code>. What happens if no format arguments are provided?",
		"threshold": 0,
		"weightmap": {}
	},

	{
		"autogen": false,
		"basescore": 50,
		"desc": "<p><a href=\"/sites/post-it/index.php\" target=\"_blank\">http://easyctf.com/sites/post-it</a></p>\n",
		"displayname": "POST-it",
		"grader": "postit",
		"hint": "It may be helpful to look into what POST requests <i>are</i>. How can you use this?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 50,
		"desc": "<p><a href=\"/sites/pointless-keys/index.php\" target=\"_blank\">Pointless website</a></p>\n",
		"displayname": "Pointless Keys",
		"grader": "pointlesskeys",
		"hint": "You may want to look at some of the <i>JavaScript</i> source code.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 60,
		"desc": "<p>Cookiezi has been banned from osu! forever, but we'll never forget him!</p><p>Only those who truly believe in the return of Cookiezi can enter this <a href=\"/sites/cookiezi\" target=\"_blank\">site</a>.</p>\n",
		"displayname": "Cookiezi Fanpage",
		"grader": "cookiezi",
		"hint": "Yum yum yum what could be more delicious than chocolate chip cookies? HTTP cookies, of course!",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 80,
		"desc": "<p>This site seems to have some information we need. Unfortunately, it's protected by a login page. Help us get through the login system!</p><p><a href=\"/sites/injection/index.php\" target=\"_blank\">Website</a> - <a href=\"/sites/injection/index.phps\" target=\"_blank\">Source</a></p>\n",
		"displayname": "Injection 1",
		"grader": "injection-1",
		"hint": "You might want to study up on some SQL syntax. How can we modify the query so it will always return true?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 30,
		"desc": "<p>Cryptography is hiding messages in plain sight. Although they can be viewed, they are usually unreadable without the use of a special key. Messages can be encrypted and then sent to another person who then decrypts the ciphertext (encrypted message) using their special key into plaintext (readable text). Try your hand at this <a href=\"http://en.wikipedia.org/wiki/Caesar_cipher\" target=\"_blank\">Caesar cipher</a>:</p> <p>IGKYGX HKIGSK ZNK LOXYZ XUSGT MKTKXGR ZU IXUYY HUZN CNKT NK HAORZ G HXOJMK GIXUYY ZNK XNOTK GTJ IUTJAIZKJ ZNK LOXYZ OTBGYOUT UL HXOZGOT.ZNKYK GINOKBKSKTZY MXGTZKJ NOS ATSGZINKJ SOROZGXE VUCKX GTJ ZNXKGZKTKJ ZU KIROVYK ZNK YZGTJOTM UL VUSVKE, CNU NGJ XKGROMTKJ NOSYKRL COZN ZNK YKTGZK GLZKX ZNK JKGZN UL IXGYYAY OT 53 HI. COZN ZNK MGRROI CGXY IUTIRAJKJ, ZNK YKTGZK UXJKXKJ IGKYGX ZU YZKV JUCT LXUS NOY SOROZGXE IUSSGTJ GTJ XKZAXT ZU XUSK. IGKYGX XKLAYKJ, GTJ SGXQKJ NOY JKLOGTIK OT 49 HI HE IXUYYOTM ZNK XAHOIUT COZN G RKMOUT, RKGBOTM NOY VXUBOTIK GTJ ORRKMGRRE KTZKXOTM XUSGT ZKXXOZUXE ATJKX GXSY. IOBOR CGX XKYARZKJ, LXUS CNOIN NK KSKXMKJ GY ZNK ATXOBGRKJ RKGJKX UL XUSK. ZNK LRGM OY IGKYGX_OY_NUSK.</p>\n",
		"displayname": "A Simple Cipher",
		"grader": "simplecipher",
		"hint": "Don't worry, it'll get harder. ;)",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 80,
		"desc": "<p>What could this possibly mean?</p><p>xhwdlsibxnmwvinalpdcbsymzzx</p>\n",
		"displayname": "Easy As CTF Gets",
		"grader": "EACG",
		"hint": "Perhaps you could try one of these <a href=\"http://rumkin.com/tools/cipher/\" target=\"_blank\">ciphers</a>.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 100,
		"desc": "<p>Once upon a midnight dreary, while I pondered, weak and weary,<br>Over many a quaint and curious volume of forgotten lore –<br>While I nodded, nearly napping, suddenly there came a tapping,<br>As of some one gently rapping, rapping at my chamber door –<br>\"'Tis some visitor,\" I muttered, \"tapping at my chamber door –<br>Only this and nothing more.\"</p><p>Ah, distinctly I remember it was in the bleak December;<br>And each separate dying ember wrought its ghost upon the floor.<br>Eagerly I wished the morrow; – vainly I had sought to borrow<br>From my books surcease of sorrow – sorrow for the lost Lenore –&nbsp;<br>For the rare and radiant maiden whom the angels name Lenore –&nbsp;<br>Nameless here for evermore.</p><p>&nbsp;</p><p>ciphertext:&nbsp;6 11&nbsp;22 28 66&nbsp;uooy htue mghn salc mria rrop clns pggl eoie nioo ifdt iwtd eres atau&nbsp;odgh dfgr doti dwii sbsc eato eorf gjgr sron owud sefe</p>\n",
		"displayname": "The Raven",
		"grader": "theraven",
		"hint": "Poems were used in cryptography in WW2 to encrypt messages, but were regarded as extremely insecure. Those first five numbers look important - what could they be referring to in the poem?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 50,
		"desc": "<p><a href=\"/problem_data/reversing-1/EasyCTF_Reversing_1.exe\">Input file</a></p>\n",
		"displayname": "Reversing 1",
		"grader": "reversing1",
		"hint": "I bet the flag is stored as a string... how can we see all the strings in a binary?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 30,
		"desc": "<p>Something appears to be wrong with this QR. Can you fix it?</p><p><img alt=\"\" src=\"/problem_data/QR/code.png\" style=\"height:184px; width:184px\"></p>\n",
		"displayname": "QR",
		"grader": "QR",
		"hint": "Normal QR's are square, aren't they?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 60,
		"desc": "<p>A friend has created a code for you to guess because he has no life and spends all his time making this kind of stuff.</p><p>Anyways, here it is: <a href=\"/problem_data/a000045/A000045.txt\">A000045.txt</a></p>\n",
		"displayname": "A000045.txt",
		"grader": "A000045",
		"hint": "Ask Google what A000045 might mean.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 30,
		"desc": "<p>How do loops work? Examine the <a href=\"/problem_data/flowchart/flowchart.png\" target=\"_blank\">flowchart</a> left for you, then match the letter choices to the correct loop. Submit the result of the loops in the order the diagrams are drawn (without line breaks or spaces) as your solution.</p>\n",
		"displayname": "Flowchart",
		"grader": "flowchart",
		"hint": "Java has several types of loops - <code>for</code>, <code>for each</code>, <code>while</code>, <code>do-while</code> - how do they differ from each other? And how do flow controls like <code>breaks</code> or <code>switch</code> statements affect how code runs?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 40,
		"desc": "<p>Networking covers everything that is related to our computer's interactions with other computers over the Internet or through some other connection. Sometimes we can trace these interactions and analyze them in order to acquire information.</p><p>You might need to install a piece of software called WireShark for this problem. Analyze the input file and look through all packets for information that might be related to a flag.</p><p>Here is the file in an online viewer, CloudShark:</p><p><a href=\"https://www.cloudshark.org/captures/1c66eb3587a1\" target=\"_blank\">https://www.cloudshark.org/captures/1c66eb3587a1</a></p><p>Alternatively, here is the source file if you like to download it and view it in WireShark:</p><p><a href=\"/problem_data/networking/mystery.pcap\">Input File</a></p>\n",
		"displayname": "Networking 1",
		"grader": "networking1",
		"hint": "It seems like information is being recorded as a form is submitted, through a POST request.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 75,
		"desc": "<p>Find the Number of Digits in the 16th Fibonacci Number that Contains 1618 and is Divisible by 1618.</p>\n",
		"displayname": "Golden Ratio Obsession",
		"grader": "GRO",
		"hint": "Use your knowledge from the previous basic python problems! (You are not, however, limited to python for this problem - you can compute the answer in any language you'd like.)",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 90,
		"desc": "<p>What kind of file is <a href=\"/problem_data/format_deception/format_deception.nds\">this</a>?</p>\n",
		"displayname": "Format Deception",
		"grader": "formatdeception",
		"hint": "After you manage to open the .nds file, (if you don't know how, Google is your best friend), look around for your flag. Maybe go against your first instinct.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 70,
		"desc": "<p>Algorithmic problems require you to write a program to solve the problem in the online python editor. Data will be generated randomly, as well as the solutions. If your program produces the required answer, the flag will be given to you. You can find this using the python link in the navigation menu above.</p><p>Given positive integers A, B, C, and L, find the sum of all the distinct multiples of A, B, and C under L.</p><p>The variables A, B, C, and L are passed through an array of variables called args. You don't have to create this; it's already there for you. This is how the generated data is passed to your program.</p><code>args = [A, B, C, L];</code></p>\n",
		"displayname": "Just Sum Numbers",
		"grader": "just-sum-numbers",
		"hint": "If you don't know how to do this problem just yet, try the Python Basics problem series first.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 75,
		"desc": "<p>You received a zip file but you find that it is corrupted! You're given that it's missing a couple of bytes at the beginning. Replace these bytes and find the flag.</p><p><a href=\"/problem_data/corrupted/corrupted.zip\" target=\"_blank\">Input file</a></p>\n",
		"displayname": "Corruption",
		"grader": "corrupted",
		"hint": "No clue what bytes to insert? Perhaps looking into file headers would be helpful. Also, you might want to download a hex editor, such as HxD.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 40,
		"desc": "<p>.... - - .--. ---... -..-. -..-. - .. -. -.-- ..- .-. .-.. .-.-.- -.-. --- -- -..-. .-.. .. -. . ... .- -. -.. -.. --- - ...</p>\n",
		"displayname": "Lines, Dots, and Shift Keys",
		"grader": "LDSK",
		"hint": "Haven't you already used a Shift Key in a previous problem?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 70,
		"desc": "<p>It appears the only thing you know about the flag is its MD5 hash <code>f54f10fd6e38929084d505d0c2e9c997</code>, and that the flag is formatted in this way: [number][adjective][color][animal] (without the brackets).</p><p>Luckily, you have found some <a href=\"/problem_data/brutus/brutus.zip\" target=\"_blank\">lists of the words</a> that may have been used.</p><p>Tribute to <a href=\"http://hsctf.com\" target=\"_blank\">http://hsctf.com</a></p>\n",
		"displayname": "Brutus",
		"grader": "brutus",
		"hint": "As the title suggests, brute forcing the answer is necessary.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 60,
		"desc": "<p>Try your hand at some <a href=\"http://en.wikipedia.org/wiki/Steganography\" target=\"_blank\">stego</a>. </p><p><img alt=\"\" src=\"/problem_data/stegosaurus/stegosaurus.jpg\" style=\"height:235px; width:400px\"></p>\n",
		"displayname": "Stegosaurus",
		"grader": "stegosaurus",
		"hint": "Open up the problem in a hex editor and take a look around.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 100,
		"desc": "<p>The first 5 primes are 2, 3, 5, 7, and 11. The 2nd, 3rd, 5th, 7th, and 11th primes are (respectively) 3, 5, 11, 17, and 31. The sum of these primes is 67. Let <code>Q(n)</code> be the sum of the <code>k</code>th prime where k is the first <code>n</code> prime numbers, as shown above. Then <code>Q(5) = 67</code>.</p><p>It can be confirmed that <code>Q(35) = 11735</code> and <code>Q(85) = 107591</code>.</p><p>If <code>args = [M,N]</code>, find Q(M) + Q(N), using the python editor.</p>\n",
		"displayname": "Project Eratosthenes",
		"grader": "project-eratosthenes",
		"hint": "Find an efficient way to generate primes.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 90,
		"desc": "<p>Obfuscation is changing variables and statements in a code so that it still performs the desired functions but is harder to read by humans. This makes it harder for people who are not supposed to see your code to understand your code. Try your hand at the following Python deobfuscation exercise:</p><p><a href=\"/problem_data/obfuscation/obfuscated.py\" target=\"_blank\">Input file</a></p>\n",
		"displayname": "Obfuscation 1",
		"grader": "obfuscation1",
		"hint": "Think backwards, reverse the encryption.",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 130,
		"desc": "<p><a href=\"/problem_data/reversing-2/EasyCTF_Reversing_2.exe\">Input file</a></p>\n",
		"displayname": "Reversing 2",
		"grader": "reversing2",
		"hint": "What happens when you change what you input?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 140,
		"desc": "<p>Can you beat the Jung? Try your hand at some fast math at <code>python.easyctf.com:10660</code>!</p>\n",
		"displayname": "Fast Math",
		"grader": "fastmath",
		"hint": "How can you solve problems quickly?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 90,
		"desc": "<p><table align=\"center\" border=\"0\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\"><tbody><tr><td><img alt=\"\" src=\"/problem_data/pixelated/1.png\" style=\"height:200px; width:200px\"></td><td><img alt=\"\" src=\"/problem_data/pixelated/2.png\" style=\"height:200px; width:200px\"></td></tr></tbody></table></p>\n",
		"displayname": "Pixelated",
		"grader": "pixelated",
		"hint": "Did you know you can do <a href=\"http://homepages.inf.ed.ac.uk/rbf/HIPR2/arthops.htm\" target=\"_blank\">arithmetic with images</a> too?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 120,
		"desc": "<p>Given a string stored in <code>args[0]</code>, find the longest palindrome inside the string, ignoring the punctuation and spacing during calculations, but including them in the final result.</p><p>For example, <code>I did roar again, Niagara! ... or did I?</code> returns <code>I did roar again, Niagara! ... or did I</code></p><p>Notice how the question mark was not part of the palindromic string, so it was not included in the answer (and neither should trailing spaces or new lines).</p>\n",
		"displayname": "Palindrama",
		"grader": "palindrama",
		"hint": "Python makes palindrome testing easy (after you remove punctuation, that is) with its ability to reverse strings!",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 160,
		"desc": "<p><a href=\"/problem_data/obfuscation/obfuscate.js\" target=\"_blank\">source</a></p>\n",
		"displayname": "Obfuscation 2",
		"grader": "obfuscation2",
		"hint": "Are there any ways to make this code more readable?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 180,
		"desc": "<p>Oh no! The door has been stolen! Find the key and open the door. <a href=\"/problem_data/door/door.c\" target=\"_blank\">source</a></p>\n",
		"displayname": "The Door",
		"grader": "door",
		"hint": "Surely you're joking, Mr. Feldman!",
		"threshold": 0,
		"weightmap": {}
	},

	{
		"autogen": false,
		"basescore": 170,
		"desc": "<p>I found an evil guessing game. Try to get the flag!</p> <p>Connect at <code>python.easyctf.com:10661</code>. <a href=\"/problem_data/mild_guess/guess.py\" target=\"_blank\">source</a></p>\n",
		"displayname": "Mildly Evil Guess",
		"grader": "mild",
		"hint": "This seems to be an impossible game. The <code>random_secret</code> is generated every time and it's completely random... or is it?",
		"threshold": 0,
		"weightmap": {}
	},
	{
		"autogen": false,
		"basescore": 180,
		"desc": "<p>This guessing game seems particularly evil. <a href=\"/problem_data/guess/guess.c\" target=\"_blank\">source</a></p>\n",
		"displayname": "Evil Guess",
		"grader": "randomConfusion-Carter1",
		"hint": "We hold these truths to be self-evident, that all base pointers are created equal, that they are endowed by their compiler with certain unalienable instructions.",
		"threshold": 0,
		"weightmap": {}
	}
]